fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыплатыПлановые</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОтразитьДолгПередСотрудником(Команда)
	ОтразитьДолгПередСотрудникомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтразитьДолгПередСотрудникомНаСервере()
	Объект.Выплаты.Очистить();
	Объект.ВыплатыПлановые.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&Начало, &Конец, , , ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("Начало",НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Конец",КонецМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток <> 0 Тогда
			НовСтр = Объект.Выплаты.Добавить();
			НовСтр.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			НовСтр.Сумма = -ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток;
			НовСтрВып = Объект.ВыплатыПлановые.Добавить();
			НовСтрВып.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			НовСтрВып.Сумма = -ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток;
     	КонецЕсли;
	КонецЦикла;
КонецПроцедуры
